[
  {
    "name": "John Smith",
    "text": "C3 Electrical did an outstanding job on our home renovation. Professional, punctual, and their work exceeded our expectations. Highly recommend!"
  },
  {
    "name": "Sarah Johnson",
    "text": "Excellent service! They responded quickly to our emergency call and fixed our electrical issue promptly. Very knowledgeable and fair pricing."
  },
  {
    "name": "Michael Davis",
    "text": "We hired C3 Electrical for our new construction project. Their attention to detail and quality workmanship was impressive. Will definitely use them again."
  },
  {
    "name": "Emily Rodriguez",
    "text": "Great experience from start to finish. They installed new lighting throughout our office and the results are fantastic. Very professional team."
  },
  {
    "name": "David Chen",
    "text": "C3 Electrical upgraded our entire electrical panel. They explained everything clearly and completed the work on time and within budget. Excellent work!"
  },
  {
    "name": "Jennifer Williams",
    "text": "Highly skilled electricians! They rewired our older home and brought everything up to code. We feel much safer now. Thank you C3 Electrical!"
  },
  {
    "name": "Robert Martinez",
    "text": "Outstanding commercial electrical work. They handled our warehouse lighting installation professionally and efficiently. Would highly recommend to any business."
  },
  {
    "name": "Lisa Thompson",
    "text": "Called C3 Electrical for a service call and they were here within hours. Fixed the problem quickly and explained what went wrong. Great service!"
  },
  {
    "name": "James Anderson",
    "text": "We've used C3 Electrical for multiple projects now. Consistently reliable, professional, and their work quality is always top-notch. Our go-to electricians!"
  },
  {
    "name": "Amanda Brown",
    "text": "Fantastic experience! They installed EV charging stations at our property. Professional installation, clean work, and great communication throughout."
  }
]
