[
  {
    "name": "Matthew Pride",
    "text": "They were great! communication was spectacular and they came and did the work super fast and as advertised! I would rehire and recommend them to everyone in the area!"
  },
  {
    "name": "Jody Dawkins",
    "text": "Anthony and team at C3 installed a home generator for me recently; extremely professional and kept me updated throughout the entire project. Pricing was reasonable and inline with other quotes. I would highly recommend C3 for any of your electrical needs."
  },
  {
    "name": "Greg Noble",
    "text": "Love these guys, they show up on time, do amazing work and charge reasonable fees."
  },
  {
    "name": "Michael Frank",
    "text": "Anthony and Sean were excellent and went above and beyond to help us. Recommend them highly."
  },
  {
    "name": "Ken Coe",
    "text": "I found C3 Electrical Contracting on Angie.com because I’m new to the areav from New England and didn’t know any electricians in the area. Anthony, the owner puts customer service first. He’s very flexible with scheduling and very prompt on timing. I highly recommend C3 Electrical Contracting if you want high quality work from a contractor you can trust. I’ve recommended C3 to everyone I know and they’ve also had great experiences with C3."
  },
  {
    "name": "Britanny Williamson",
    "text": "C3 came out quickly to give me a free estimate. They had the most reasonable price by a long shot! I got an email shortly after saying that if I’d like to get on the schedule they could make sure to get out to me as soon as possible. I had some issues with the delivery of my hot tub so they were accommodating about switching our install date. They arrived earlier than expected and had everything installed in an exceptional time. The crew (Anthony and didn’t catch the other guys name 😬) were so friendly and awesome! Even asking if they could help me do certain things that needed to be done to get the hot tub filled.  If you’re needing any kind of electrical work, absolutely hit these guys up!!!"
  },
  {
    "name": "David Forler",
    "text": "C3 is always on time, always listen to our needs, gives numerous choices for what we want done. great pricing as well. They are above a 5 Star company."
  },
  {
    "name": "Lisa Thompson",
    "text": "Called C3 Electrical for a service call and they were here within hours. Fixed the problem quickly and explained what went wrong. Great service!"
  },
  {
    "name": "Kathy Williams",
    "text": "All the projects they did for me (new outlets, new light outlet and hang light, and generator plug install) were done really well and they totally clean up after. They are super professional and super nice to work with. Highly recommend. Will use them again for more projects."
  },
  {
    "name": "Alex Churchill",
    "text": "If I could give 10 stars, I would. Anthony and the guys at C3 Electrical were awesome! They installed a bathroom fan for me, including duct work, an outside vent, and dual switch. They were affordable, quick, communicative, and all around good people! They even noticed a crack in my siding near my ring camera and filled it with silicone just because! Would recommend them to anyone who needs any electrical work done! (:"
  },
  {
    "name": "Ann Pope",
    "text": "Out of the multiple electricians I had contacted, Anthony from C3 Electrical was by far the most professional. He scheduled an exact appointment time and day, confirmed the appointment witha follow up call and let me know when he was on his way. This is a vast difference from the other responses of 'well I may be by today or tomorrow or whenever' and then not showing up or even contacting me to let me know they aren't coming. Anthony showed up, gave his estimate, and performed quality work. He even helped in picking just the right look for the chandelier bulbs. C3 AND Anthony will be my forever electrician! Ann Pope Lelans NC"
  }
]
